stop_word_list = [
  // "ስለሚሆን",
  // "አና",
  // "ስለዚህ",
  // "በመሆኑም",
  // "ሁሉ",
  // "ሆነ",
  // "ሌላ",
  // "ልክ",
  // "ስለ",
  // "በቀር",
  // "ብቻ",
  // "ና",
  // "አንዳች",
  // "አንድ",
  // "እንደ",
  // "እንጂ",
  // "ያህል",
  // "ይልቅ",
  // "ወደ",
  // "እኔ",
  // "የእኔ",
  // "ራሴ",
  // "እኛ",
  // "የእኛ",
  // "እራሳችን",
  // "አንቺ",
  // "የእርስዎ",
  // "ራስህ",
  // "ራሳችሁ",
  // "እሱ",
  // "እሱን",
  // "የእሱ",
  // "ራሱ",
  // "እርሷ",
  // "የእሷ",
  // "ራሷ",
  // "እነሱ",
  // "እነሱን",
  // "የእነሱ",
  // "እራሳቸው",
  // "ምንድን",
  // "የትኛው",
  // "ማንን",
  // "ይህ",
  // "እነዚህ",
  // "እነዚያ",
  // "ነኝ",
  // "ነው",
  // "ናቸው",
  // "ነበር",
  // "ነበሩ",
  // "ሁን",
  // "ነበር",
  // "መሆን",
  // "አለኝ",
  // "አለው",
  // "ነበረ",
  // "መኖር",
  // "ያደርጋል",
  // "አደረገው",
  // "መሥራት",
  // "እና",
  // "ግን",
  // "ከሆነ",
  // "ወይም",
  // "ምክንያቱም",
  // "እንደ",
  // "እስከ",
  // "ቢሆንም",
  // "ጋር",
  // "ላይ",
  // "መካከል",
  // "በኩል",
  // "ወቅት",
  // "በኋላ",
  // "ከላይ",
  // "በርቷል",
  // "ጠፍቷል",
  // "በላይ",
  // "ስር",
  // "እንደገና",
  // "ተጨማሪ",
  // "ከዚያ",
  // "አንዴ",
  // "እዚህ",
  // "እዚያ",
  // "መቼ",
  // "የት",
  // "እንዴት",
  // "ሁሉም",
  // "ማናቸውም",
  // "ሁለቱም",
  // "እያንዳንዱ",
  // "ጥቂቶች",
  // "ተጨማሪ",
  // "በጣም",
  // "ሌላ",
  // "አንዳንድ",
  // "አይ",
  // "ወይም",
  // "አይደለም",
  // "ብቻ",
  // "የራስ",
  // "ተመሳሳይ",
  // "ስለዚህ",
  // "እኔም",
  // "በጣም",
  // "ይችላል",
  // "ይሆናል",
  // "በቃ",
  // "አሁን",
  // "ነው",
  // //
  // "",
  // "ውስጥ",
  // "ሰው",
  // "ብሎ",
  // "ነገር",
  // "ደግሞ",
  // "ጊዜ",
  // "ምን",
  // "ዛሬ",
  // "ክልል",
  // "ሁኔታ",
  // "ብዙ",
  // "በዚህ",
  // "በፊት",
  // "ሆኖ",
  // "ኢትዮጵያ",
  // "ያለው",
  // "ማድረግ",
  // "ያለ",
  // "የሚል",
  // "ከዚህ",
  // "ሳይሆን",
  // "ጉዳይ",
  // "ይህን",
  // "የኢትዮጵያ",
  // "ብለው",
  // "በተለይም",
  // "የአማራ",
  // "ህዝብ",
  // "ድረስ",
  // "አብይ",
  // "እንደሆነ",
  // "ደረጃ",
  // "ችግር",
  // "ማለት",
  // "የለም",
  // "የሚለው",
  // "አይነት",
  // "ምክንያት",
  // "እያለ",
  // "ይገባል",
  // "ሙሉ",
  // "የሆነ",
  // "ከፍተኛ",
  // "መንገድ",
  // "ሌላው",
  // "አዲስ",
  // "ቀን",
  // "ይህንን",
  // "ቤት",
  // "ኢትዮጵያን",
  // "አለበት",
  // "መሆኑን",
  // "አበባ",
  // "ጦርነት",
  // "ሲሆን",
  // "አድርጎ",
  // "ይቻላል",
  // "እንኳን",
  // "ይሁን",
  // "በሙሉ",
  // "ቢሆን",
  // "ራሱን",
  // "አለ",
  // "ስልጣን",
  // "አገር",
  // "አንዱ",
  // "በኢትዮጵያ",
  // "የፖለቲካ",
  // "አልፎ",
  // "በማለት",
  // "ጦር",
  // "ሰዎች",
  // "ሌሎች",
  // "ከፍ",
  // "ተብሎ",
  // "እንዲህ",
  // "በማድረግ",
  // "በተለይ",
  // "ያላቸውን",
  // "ያለውን",
  // "ሊሆን",
  // "አካል",
  // "ምንም",
  // "ጥሩ",
  // "ልዩ",
  // "እጅ",
  // "መንግስት",
  // "ዘመን",
  // "ፖለቲካ",
  // "ጥቅም",
  // "በመሆኑ",
  // "መሆኑ",
  // "ስለሆነ",
  // "ትግል",
  // "ዓመት",
  // "ልጅ",
  // "ደም",
];
var tempStopWord =
  "ላይ ነው ጋር ወደ እና ግን ብቻ ሁሉ ውስጥ ይህ እንደ ሰው ብሎ ነገር ነበር ደግሞ አንድ ጊዜ ምን ናቸው ወይም በላይ አሁን በኋላ ዛሬ ክልል ሁኔታ ብዙ በዚህ በፊት ሆኖ ኢትዮጵያ ያለው ማድረግ ያለ አይደለም የሚል ከዚህ ሳይሆን ጉዳይ ወቅት ያህል ይህን እንጂ የኢትዮጵያ ብለው በተለይም ሌላ የአማራ ህዝብ ድረስ መሆን አብይ እንደሆነ ደረጃ ችግር ማለት ስለ የለም የሚለው ሆነ አይነት ምክንያት እያለ ይገባል ሙሉ የሆነ ከፍተኛ መንገድ እኔ ሌላው አዲስ እኛ እስከ እንዴት ቀን ይልቅ ይሆናል ይህንን ቤት ኢትዮጵያን ይችላል አለበት መሆኑን አበባ ጦርነት ሁሉም ሲሆን አድርጎ ቢሆንም ይቻላል እንኳን ይሁን በሙሉ ቢሆን ራሱን አለ ስልጣን አገር አንዱ በኢትዮጵያ የፖለቲካ አልፎ መካከል በማለት ጦር ሰዎች ሌሎች ከፍ ተብሎ እንዲህ አንዳንድ በማድረግ በተለይ ከሆነ ያላቸውን ያለውን ሊሆን አካል ምንም ጥሩ ልዩ እጅ መንግስት ዘመን ፖለቲካ ጥቅም በመሆኑ መሆኑ ስለሆነ ትግል ዓመት ልጅ እነዚህ ደም ጀምሮ የሚባል ዋና ያሉ መሪ የሆነው ስሜት ቦታ በአንድ አማራ እጅግ አህመድ ገና ጥያቄ ሰላም በተግባር ያላቸው ይሄ ውጭ ሲል ሥራ ነኝ በኩል ትልቅ ዛሬም የዘር በቂ ተገቢ ያለበት መከላከያ ይዞ መልኩ ስለሆነም መፍትሄ አቶ ውጤት በዚህም የኦሮሞ አጀንዳ ሆነው ይህም ልክ አደጋ ብለን ከላይ ከባድ ዓመታት የነበረው አማራጭ ኢትዮጵያዊ እያሉ ወንጀል ዘንድ እምነት አለው ለማድረግ ችግሮች መኖር የሌለው ዓለም ሁለት አማራን በሚል እንዲሆን ተስፋ ጠንካራ ጠቅላይ ወይ ሃይል እናም ሶስት ጥቃት እንዲሁም ሆኗል መከራ ይላል መጀመሪያ የሆኑ አለኝ የተለያዩ ካለ ለምሳሌ እዚህ በራሱ ስም ማን ስራ ከህዝብ ኦሮሚያ በቀላሉ አድርገው ጉዳት አካባቢ ስለዚህ በወቅቱ መሪዎች ለምን የለውም መሰረት ከተማ አቅም የተባለው መጠየቅ እውነት የተሻለ በጣም ተግባር ሰዓት ሲሉ በደል የህዝብ እንጅ በመጠቀም አቀፍ አሉ በሌላ ሲመጣ የውስጥ ታሪክ የነበሩ ወያኔ የዛሬ ሰሞኑን ማጥፋት ዶክተር መንግሥት ተግባራዊ ይመስላል ማንም ግፍ ትግራይ ኃይል የሚሉ ዝም አሜሪካ ማንነት ያስፈልጋል ሀሳብ ያሉትን ህግ ከዚያም ትኩረት ከዚህም በሰላም ጨምሮ ሚሊዮን በርካታ እንደገና ጭምር ስጋት ምክር አካሄድ የሚለውን በትግራይ ሁሉን ፍላጎት ልብ አብሮ ይገኛል መልካም";

stop_word_list = tempStopWord.split(" ");
const signs = new RegExp("[“…=,.+<>’—”–!?()|:፡።‹›፣፤-]", "g");
const multipleSpaces = new RegExp("\\s+", "g");
const englishWords = new RegExp("[a-zA-Z]+", "g");
const numberExceptDate = new RegExp(
  "(?<!\\bዓ\\.ም\\s*)\\b(?!\\d{1,2}\\/\\d{1,2}(\\/\\d{2,4})?\\b)\\S*\\d+\\S*",
  "g"
);

// const fs = require("fs");
// // Read json from functionalCorpus
// functionalCorpus = JSON.parse(fs.readFileSync("./corpus/functionalCorpus.json", "utf-8"));

const getPrunedText = (text) => {
  // Prune signs
  text = text.replace(signs, "");
  //   Prune english
  text = text.replace(englishWords, "");
  // Prune multiple spaces
  text = text.replace(multipleSpaces, " ");

  // Prune numbers except date
  text = text.replace(numberExceptDate, "");

  //   Remove stop words and single characters
  splittedText = text.split(" ");
  text = splittedText.filter((word) => !stop_word_list.includes(word) && word.length > 1);
  return text;
};

const PruneCorpus = (corpus) => {
  corpus.forEach((document, index) => {
    document.index = getPrunedText(document.index);
  });
  return corpus;
};

const PruneQuery = (query) => {
  return getPrunedText(query);
};

module.exports = { PruneCorpus, PruneQuery };
// // Write pruned corpus
// fs.writeFile("./corpus/pruned.json", JSON.stringify(functionalCorpus, null, 2), "utf8", (err) => {
//   if (err) {
//     console.error(err);
//     return;
//   }
//   console.log("Pruned corpus generated");
// });
